ghsecuritylab/ble_timesync/nRF5_SDK_15.3.0_59ac345/Slave_Node/main.c
//BLE_NUS_DEF(m_nus, NRF_SDH_BLE_TOTAL_LINK_COUNT);                                   /**< BLE NUS service instance. */
NRF_BLE_GATT_DEF(m_gatt);                                                           /**< GATT module instance. */
//NRF_BLE_QWR_DEF(m_qwr);                                                           /**< Context for the Queued Write module.*/
NRF_BLE_QWRS_DEF(m_qwr, NRF_SDH_BLE_TOTAL_LINK_COUNT);                              /**< Context for the Queued Write module.*/
BLE_ADVERTISING_DEF(m_advertising);                                                 /**< Advertising module instance. */

static uint16_t   m_conn_handle          = BLE_CONN_HANDLE_INVALID;                 /**< Handle of the current connection. */
static uint16_t   m_ble_nus_max_data_len = BLE_GATT_ATT_MTU_DEFAULT - 3;            /**< Maximum length of data (in bytes) that can be transmitted to the peer by the Nordic UART service module. */
static ble_uuid_t m_adv_uuids[]          =                                          /**< Universally unique service identifier. */
{
    {BLE_UUID_SIEMENS_SERVICE, SIEMENS_SERVICE_UUID_TYPE},
    {BLE_UUID_DEVICE_INFORMATION_SERVICE, BLE_UUID_TYPE_BLE}
};

#define SAMPLES_IN_BUFFER 1


const char *SUBSCRIBE = "ATCONF";
bool measurment_begin = false;
static nrf_saadc_value_t     m_buffer[SAMPLES_IN_BUFFER];
static ble_siemens_t xteristics_status[NUMBER_OF_SIEMENS_XTERISTICS];

float store_analogValues[20] = {[0 ... 19] = 0};
uint32_t get_timestamp[20] = {[0 ... 19] = 0};
uint16_t sampling_size = 20; 
uint16_t copy_sampling_size = 20;
uint16_t track_vol = 20;
bool transmit_check = false;
bool data_ready = false;

float sample_mean = 0;
double root_mean_square = 0;
uint8_t command[3];
static float X_value, Y_value, Z_value = NULL;
float sample_max, sample_min = 0;
float zero_crossing[20];
uint16_t lenght;
uint8_t sample_mean_encode[8];
uint8_t sample_min_encode[8];
uint8_t sample_test_encode[8] = {0,1,2,3,4,5,6,7};
uint8_t sample_max_encode[8];
uint8_t root_mean_square_encode[8];
uint8_t adc_encode[8];
uint8_t z_adc_encode[8];
uint8_t t_adc_encode[5];
uint16_t size_of_encode_float = sizeof(sample_mean_encode)/sizeof(sample_mean_encode[0]);


/**@brief Function for assert macro callback.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyse
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num    Line number of the failing ASSERT call.
 * @param[in] p_file_name File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}




/**@
 *
 * @Function to send data
 */

 /*void send_data(void)
 {
    static uint8_t data_to_send[100];
    uint16_t length = m_ble_nus_max_data_len;
    uint8_t temp_buf[length];
    if (zeros_ready)
    {
        sprintf(data_to_send, "MIN:%.3f,", sample_min);
        //length = (uint16_t)strlen(data_to_send);
        //ble_nus_data_send(&m_nus, data_to_send, &length, m_conn_handle);
        //memset(&data_to_send[0], 0, sizeof(data_to_send));


        sprintf(data_to_send + strlen(data_to_send), "MAX:%.3f,", sample_max);
        //length = (uint16_t)strlen(data_to_send);
        //ble_nus_data_send(&m_nus, data_to_send, &length, m_conn_handle);
        //memset(&data_to_send[0], 0, sizeof(data_to_send));


        sprintf(data_to_send + strlen(data_to_send), "RMS:%.3f,", root_mean_square);
        //length = (uint16_t)strlen(data_to_send);
        //ble_nus_data_send(&m_nus, data_to_send, &length, m_conn_handle);
        //memset(&data_to_send[0], 0, sizeof(data_to_send));
        
        
        sprintf(data_to_send + strlen(data_to_send), "Z_X:");
        //length = (uint16_t)strlen(data_to_send);
        //ble_nus_data_send(&m_nus, data_to_send, &length, m_conn_handle);
        //memset(&data_to_send[0], 0, sizeof(data_to_send));
        for (int i = 0; i < sizeof(zero_crossing)/sizeof(zero_crossing[0]); i++)
        {
            sprintf(data_to_send + strlen(data_to_send), "%.3f,", zero_crossing[i]); // fixed number of zero crossing is necessary
            //length = (uint16_t)strlen(data_to_send);
            //ble_nus_data_send(&m_nus, data_to_send, &length, m_conn_handle);
            //memset(&data_to_send[0], 0, sizeof(data_to_send));
        }

        sprintf(data_to_send + strlen(data_to_send), "\r");

        //send data in fragments
        for(int i,j = 0; i < strlen(data_to_send); i++)
        {
            memcpy(temp_buf, data_to_send + j, length);
            ble_nus_data_send(&m_nus, temp_buf, &length, m_conn_handle);
            j += length;
            memset(&temp_buf[0], 0, sizeof(temp_buf));

        }



        zeros_ready = false;
        sampling_size = sampling_size == NULL ? copy_sampling_size : sampling_size;
        memset(&store_analogValues[0], 0, sizeof(store_analogValues));
        memset(&store_analogValues[0], 0, sizeof(store_analogValues));
        memset(&temp_buf[0], 0, sizeof(temp_buf));
        sample_mean = 0.0;
        sample_max = 0.0;
        sample_min = 0.0;
        root_mean_square = 0.0;


    }
 }*/








/**@computing zero crossing and prepare the string to be sent.
 *
 * @subject to change depending on the performance of the algorithm
 */


 void compute_sample_mean(void)
 {
    csfloat_t encode;
    sample_max = store_analogValues[0];
    sample_min = store_analogValues[0];
    for(int i = 0; i < copy_sampling_size; i++)
    {
        //printf("\r%f\n", store_analogValues[i]);
        sample_mean += store_analogValues[i];
        sample_max = sample_max > store_analogValues[i] ? sample_max : store_analogValues[i];
        sample_min = sample_min < store_analogValues[i] ? sample_min : store_analogValues[i];
    }
    sample_mean = sample_mean/copy_sampling_size;
    encode = encode_float(sample_mean);
    c_bds_sfloat_encode(&encode, sample_mean_encode);

    //printf("\rMIN IS %f\n", sample_min);
    //printf("\rMAX IS %f\n", sample_max);
    //printf("\rMEAN IS %f\n", sample_mean);
    //printf("\r%x", sample_mean_encode[0]);
    //printf("%x", sample_mean_encode[1]);
    //printf("%x", sample_mean_encode[2]);
    //printf("%x", sample_mean_encode[3]);
    //printf("%x", sample_mean_encode[4]);
    //printf("%x", sample_mean_encode[5]);
    //printf("%x", sample_mean_encode[6]);
    //printf("%x\n", sample_mean_encode[7]);


