ghsecuritylab/ble_timesync/nRF5_SDK_15.3.0_59ac345/Slave_Node/main.c
 }

 /**@brief Function for computing rms.
 */

 void compute_rms(void)
 {
    csfloat_t encode;
    for(int i = 0; i < copy_sampling_size; i++)
    {
        root_mean_square += pow(store_analogValues[i],2);
        
    }
    root_mean_square /= sample_mean;
    root_mean_square = sqrt(root_mean_square);

    encode = encode_float(root_mean_square);
    c_bds_sfloat_encode(&encode, root_mean_square_encode);


    //printf("\r%x", root_mean_square_encode[0]);
    //printf("%x", root_mean_square_encode[1]);
    //printf("%x", root_mean_square_encode[2]);
    //printf("%x", root_mean_square_encode[3]);
    //printf("%x", root_mean_square_encode[4]);
    //printf("%x", root_mean_square_encode[5]);
    //printf("%x", root_mean_square_encode[6]);
    //printf("%x\n", root_mean_square_encode[7]);

 }

 /**@brief Function for computing sample offset.
 */
void compute_sample_offset(void)
 {
    for(int i = 0; i < copy_sampling_size; i++)
    {
        store_analogValues[i] -= sample_mean;
    }
 }

/**@brief Function for computing zero crossings.
 */
void compute_zero_crossing(void)
{
    compute_sample_offset();
    
    for(int i = 0; i + 1 < copy_sampling_size; i++)
    {
        if(i != copy_sampling_size - 1)
        {
            store_analogValues[i] = (store_analogValues[i] * 1 < 0 && store_analogValues[i + 1] * 1 > 0) || 
                                    (store_analogValues[i] * 1 > 0 && store_analogValues[i + 1] * 1 < 0) ? 
                                    store_analogValues[i] : 0;
        }
    }

    for(int i = 0; i + 1 < copy_sampling_size; i++)
    {
        if (store_analogValues[i] != NULL)
        {
            zero_crossing[i] = (store_analogValues[i] + store_analogValues[i + 1]) / 2;
            zero_crossing[i + 1] = (get_timestamp[i] + get_timestamp[i + 1]) / 2;
            i += 1;
        }
    }



}



/**@brief Function for processing the data received from BLE_NUS Service.
 */
/*void data_splitter(char *command)
{
    char temp_buf[30];
    uint8_t check_comma = 0;
    if(strcmp(command, SUBSCRIBE) == 0)
    {
        //start extracting data
        if (command[9] == 'I')
        {
            for (int i = 11; i < strlen(command); i++)
            {
                if(command[i] != ',')
                {
                    temp_buf[i] = command[i];
                } else {
                    check_comma += 1;
                    switch(check_comma)
                    {
                        case 1:
                            X_value = atof(temp_buf);
                            memset(&temp_buf[0], 0, sizeof(temp_buf));
                            break;
                        case 2:
                            Y_value = atof(temp_buf);
                            memset(&temp_buf[0], 0, sizeof(temp_buf));
                        case 3:
                            Z_value = atof(temp_buf);
                            memset(&temp_buf[0], 0, sizeof(temp_buf));
                            memcpy(temp_buf, command + i, strlen(command) - 1);
                            sampling_size = atoi(temp_buf);
                            memset(&temp_buf[0], 0, sizeof(temp_buf));
                        default:
                            continue;
                    }
                }

            }
        } else {
            memcpy(temp_buf, command + 9, strlen(command) - 1);
            sampling_size = atoi(temp_buf);
            copy_sampling_size = atoi(temp_buf);
            memset(&temp_buf[0], 0, sizeof(temp_buf));
            X_value, Y_value, Z_value = 0.0;

        }
    }
}*/


static void sync_timer_button_init(void)
{
    uint32_t       err_code;
    uint8_t        rf_address[5] = {0xDE, 0xAD, 0xBE, 0xEF, 0x19};
    ts_params_t    ts_params;
    
    // Debug pin: Toggle P0.24 from sync timer to allow pin measurement
    nrf_gpiote_task_configure(3, 27, NRF_GPIOTE_POLARITY_TOGGLE, NRF_GPIOTE_INITIAL_VALUE_LOW);
    nrf_gpiote_task_enable(3);
    uint32_t saadc_sample_task_addr   = nrf_drv_saadc_sample_task_get();
    
    nrf_ppi_channel_endpoint_setup(
        NRF_PPI_CHANNEL0,
        (uint32_t) nrf_timer_event_address_get(NRF_TIMER3, NRF_TIMER_EVENT_COMPARE4),
        nrf_gpiote_task_addr_get(NRF_GPIOTE_TASKS_OUT_3));
    nrf_ppi_channel_enable(NRF_PPI_CHANNEL0);

    nrf_ppi_channel_endpoint_setup(
        NRF_PPI_CHANNEL5,
        (uint32_t) nrf_timer_event_address_get(NRF_TIMER3, NRF_TIMER_EVENT_COMPARE4),
        saadc_sample_task_addr);
    nrf_ppi_channel_enable(NRF_PPI_CHANNEL5);
    
    ts_params.high_freq_timer[0] = NRF_TIMER3;
    ts_params.high_freq_timer[1] = NRF_TIMER2;
    ts_params.rtc             = NRF_RTC1;
    ts_params.egu             = NRF_EGU3;
    ts_params.egu_irq_type    = SWI3_EGU3_IRQn;
    ts_params.ppi_chg         = 0;
    ts_params.ppi_chns[0]     = 1;
    ts_params.ppi_chns[1]     = 2;
    ts_params.ppi_chns[2]     = 3;
    ts_params.ppi_chns[3]     = 4;
    ts_params.rf_chn          = 125; /* For testing purposes */
    memcpy(ts_params.rf_addr, rf_address, sizeof(rf_address));
    
    err_code = ts_init(&ts_params);
    APP_ERROR_CHECK(err_code);
    
    err_code = ts_enable();
    APP_ERROR_CHECK(err_code);
    NRF_LOG_INFO("Started listening for beacons.\r\n");
    NRF_LOG_INFO("Press Button 1 to start sending sync beacons\r\n");
}













/**@brief Function for assert macro callback.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num    Line number of the failing ASSERT call.
 * @param[in] p_file_name File name of the failing ASSERT call.
 */

void saadc_callback(nrf_drv_saadc_evt_t const * p_event)
{
    if (p_event->type == NRF_DRV_SAADC_EVT_DONE)
    {
        ret_code_t err_code;
        err_code = nrf_drv_saadc_buffer_convert(p_event->data.done.p_buffer, SAMPLES_IN_BUFFER);
        APP_ERROR_CHECK(err_code);
        if(measurment_begin == true && sampling_size > 0)
        {
            get_timestamp[copy_sampling_size - sampling_size] = ts_timestamp_get_ticks_u32(NRF_PPI_CHANNEL10);
            store_analogValues[copy_sampling_size - sampling_size] = ((X_value * .0001 != NULL) && (Y_value * .0001 != NULL) && (Z_value * .0001 != NULL)) ? 
                                                                      (600 * ((p_event->data.done.p_buffer[0] / (1 + (400/X_value))) - (Y_value/2) + (Y_value/(100 + Z_value)))) : 
                                                                      p_event->data.done.p_buffer[0];
            sampling_size -= 1;
            //you might need a memset here to clean analog and timestamp arrays
        } else if (sampling_size == 0)
        {
            data_ready = true;
            //nrf_drv_saadc_uninit();

        } else
        {
            //do nothing
        }
    } else
    {
        return;
    }
}
//err_code = ble_nus_data_send(&m_nus, data_array, &length, m_conn_handle);

void saadc_init(void)
{
    ret_code_t err_code;
    nrf_saadc_channel_config_t channel_config 
        = NRF_DRV_SAADC_DEFAULT_CHANNEL_CONFIG_SE(NRF_SAADC_INPUT_AIN1);

    err_code = nrf_drv_saadc_init(NULL, saadc_callback);
    APP_ERROR_CHECK(err_code);

