ghsecuritylab/ble_timesync/nRF5_SDK_15.3.0_59ac345/Slave_Node/main.c
    err_code = nrf_drv_saadc_channel_init(0, &channel_config);
    APP_ERROR_CHECK(err_code);

    err_code = nrf_drv_saadc_buffer_convert(m_buffer, SAMPLES_IN_BUFFER);
    APP_ERROR_CHECK(err_code);
}















/**@brief Function for initializing the timer module.
 */
static void timers_init(void)
{
    ret_code_t err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for the GAP initialization.
 *
 * @details This function will set up all the necessary GAP (Generic Access Profile) parameters of
 *          the device. It also sets the permissions and appearance.
 */
static void gap_params_init(void)
{
    uint32_t                err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *) DEVICE_NAME,
                                          strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling Queued Write Module errors.
 *
 * @details A pointer to this function will be passed to each service which may need to inform the
 *          application about an error.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void nrf_qwr_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}

/**@brief Function for starting advertising.
 */
static void advertising_start(void)
{
    uint32_t err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
    APP_ERROR_CHECK(err_code);
}




/**@brief Function for handling the data from the Nordic UART Service.
 *
 * @details This function will process the data received from the Nordic UART BLE Service and send
 *          it to the UART module.
 *
 * @param[in] p_evt       Nordic UART Service event.
 */
/**@snippet [Handling the data received over BLE] */
static void siemens_data_handler(ble_siemens_t * p_siemens, ble_siemens_evt_t * p_evt)
{
    if (p_evt->evt_type == BLE_SIEMENS_EVT_ON_WRITE)
    {
        uint32_t err_code;
        NRF_LOG_DEBUG("Received data from BLE SIEMENS.");
        NRF_LOG_HEXDUMP_DEBUG(p_evt->p_data, p_evt->length);

        for (uint32_t i = 0; i < p_evt->length; i++)
        {
            do
            {
                //err_code = app_uart_put(p_evt->p_data[i]);
                printf("\r%x\n",p_evt->p_data[i]);
                //APP_ERROR_CHECK(err_code);
                //memcpy(command,p_evt->p_data,strlen(p_evt->p_data));
                //data_splitter(command);
                if ((err_code != NRF_SUCCESS) && (err_code != NRF_ERROR_BUSY))
                {
                    NRF_LOG_ERROR("Failed receiving Siemens Service message. Error 0x%x. ", err_code);
                    APP_ERROR_CHECK(err_code);
                }
            } while (err_code == NRF_ERROR_BUSY);
        }
        if (p_siemens->battery_level_handles.value_handle == xteristics_status[X_VALUE_INDEX].battery_level_handles.value_handle)
        {
            // decode float for x
            X_value = decode_float_values(p_evt->p_data, p_evt->length);
        } else if (p_siemens->battery_level_handles.value_handle == xteristics_status[Y_VALUE_INDEX].battery_level_handles.value_handle)
        {
            //decode float for y
            Y_value = decode_float_values(p_evt->p_data, p_evt->length);
        } else if (p_siemens->battery_level_handles.value_handle == xteristics_status[Z_VALUE_INDEX].battery_level_handles.value_handle)
        {
            //decode float for z
            Z_value = decode_float_values(p_evt->p_data, p_evt->length);
        } else if (p_siemens->battery_level_handles.value_handle == xteristics_status[COMMAND_INDEX].battery_level_handles.value_handle)
        {
            //start measurement immediately
            measurment_begin = true;
        } else
        {
            //do nothing
        }
        //if (p_evt->p_data[p_evt->length - 1] == '\0')
        //{
            //while (app_uart_put('\n') == NRF_ERROR_BUSY);
        //}
    }

}
/**@snippet [Handling the data received over BLE] */


/**@brief Function for initializing services that will be used by the application.
 */
static void services_init(void)
{
    uint32_t           err_code;
    //ble_nus_init_t     nus_init;
    ble_siemens_init_t     siemens_init;
    ble_siemens_sys_id_t   manufacturer_info;
    ble_dis_init_t     dis_init;
    ble_dis_sys_id_t   dis_manufacturer_info;
    nrf_ble_qwr_init_t qwr_init = {0};

    // Initialize Queued Write Module.
    qwr_init.error_handler = nrf_qwr_error_handler;

    for (uint32_t i = 0; i < 1; i++)
    {
        err_code = nrf_ble_qwr_init(&m_qwr[i], &qwr_init);
        APP_ERROR_CHECK(err_code);
    }

    //err_code = nrf_ble_qwr_init(&m_qwr, &qwr_init);
    //APP_ERROR_CHECK(err_code);

    // Initialize NUS.
    //memset(&nus_init, 0, sizeof(nus_init));

    //nus_init.data_handler = nus_data_handler;

    //err_code = ble_nus_init(&m_nus, &nus_init);
    //APP_ERROR_CHECK(err_code);

    // Initialize Siemens Service.
    memset(&siemens_init, 0, sizeof(siemens_init));
    
    siemens_init.evt_handler = siemens_data_handler;
    siemens_init.support_notification = true;
    siemens_init.p_report_ref = NULL;

    siemens_init.dis_char_rd_sec = SEC_OPEN;
    siemens_init.siemens_cccd_wr_sec = SEC_OPEN;
    siemens_init.siemens_report_rd_sec= SEC_OPEN;


    // add siemens service
    err_code = add_siemens_service(xteristics_status, &siemens_init);
    APP_ERROR_CHECK(err_code);

    //add the MAXIMUM xteristics
    err_code = char_add(BLE_UUID_ENV_MAXIMUM_CHARACTERISTIC, &xteristics_status[MAX_INDEX], &siemens_init, MAX_INDEX);
    printf("\rMAXIMUMOOO H %x\n", xteristics_status[MAX_INDEX].battery_level_handles.value_handle);
    APP_ERROR_CHECK(err_code);

