ghsecuritylab/ble_timesync/nRF5_SDK_15.3.0_59ac345/Slave_Node/main.c
    //add the MINIMUM xteristics
    err_code = char_add(BLE_UUID_ENV_MINIMUM_CHARACTERISTIC, &xteristics_status[MIN_INDEX], &siemens_init, MIN_INDEX);
    printf("\rMINIMUM H %x\n", xteristics_status[MIN_INDEX].battery_level_handles.value_handle);
    APP_ERROR_CHECK(err_code);

    //add the ADC xteristics
    err_code = char_add(BLE_UUID_ENV_ADC_VALUE_CHARACTERISTIC, &xteristics_status[ADC_INDEX], &siemens_init, MAX_INDEX);
    APP_ERROR_CHECK(err_code);


     //add the RMS xteristics
    err_code = char_add(BLE_UUID_ENV_RMS_CHARACTERISTIC, &xteristics_status[RMS_INDEX], &siemens_init, RMS_INDEX);
    APP_ERROR_CHECK(err_code);

    //add the X_VALUE xteristics
    err_code = char_add(BLE_UUID_ENV_X_VALUE_CHARACTERISTIC, &xteristics_status[X_VALUE_INDEX], &siemens_init, X_VALUE_INDEX);
    APP_ERROR_CHECK(err_code);

    //add the Y_VALUE xteristics
    err_code = char_add(BLE_UUID_ENV_Y_VALUE_CHARACTERISTIC, &xteristics_status[Y_VALUE_INDEX], &siemens_init, Y_VALUE_INDEX);
    APP_ERROR_CHECK(err_code);


    //add the Z_VALUE xteristics
    err_code = char_add(BLE_UUID_ENV_Z_VALUE_CHARACTERISTIC, &xteristics_status[Z_VALUE_INDEX], &siemens_init, Z_VALUE_INDEX);
    APP_ERROR_CHECK(err_code);


    //add the MEAN_VALUE xteristics
    err_code = char_add(BLE_UUID_ENV_MEAN_VALUE_CHARACTERISTIC, &xteristics_status[MEAN_INDEX], &siemens_init, MEAN_INDEX);
    APP_ERROR_CHECK(err_code);


    //add the COMMAND xteristics
    err_code = char_add(BLE_UUID_ENV_COMMAND_CHARACTERISTIC, &xteristics_status[COMMAND_INDEX], &siemens_init, COMMAND_INDEX);
    APP_ERROR_CHECK(err_code);

    //add the ZERO_CROSSING xteristics
    err_code = char_add(BLE_UUID_ENV_ZERO_CROSSING_CHARACTERISTIC, &xteristics_status[INCASE_INDEX], &siemens_init, INCASE_INDEX);
    APP_ERROR_CHECK(err_code);

    // Initialize Device Information Service.
    memset(&dis_init, 0, sizeof(dis_init));

    ble_srv_ascii_to_utf8(&dis_init.manufact_name_str, (char *)MANUFACTURER_NAME);
    ble_srv_ascii_to_utf8(&dis_init.model_num_str, (char *)MODEL_NUM);
    dis_manufacturer_info.manufacturer_id = MANUFACTURER_ID;
    dis_init.p_sys_id = &dis_manufacturer_info;
    dis_init.dis_char_rd_sec = SEC_OPEN;
    err_code = ble_dis_init(&dis_init);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling an event from the Connection Parameters Module.
 *
 * @details This function will be called for all events in the Connection Parameters Module
 *          which are passed to the application.
 *
 * @note All this function does is to disconnect. This could have been done by simply setting
 *       the disconnect_on_fail config parameter, but instead we use the event handler
 *       mechanism to demonstrate its use.
 *
 * @param[in] p_evt  Event received from the Connection Parameters Module.
 */
static void on_conn_params_evt(ble_conn_params_evt_t * p_evt)
{
    uint32_t err_code;

    if (p_evt->evt_type == BLE_CONN_PARAMS_EVT_FAILED)
    {
        err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_CONN_INTERVAL_UNACCEPTABLE);
        APP_ERROR_CHECK(err_code);
    }
}

/**@brief Function for handling errors from the Connection Parameters module.
 *
 * @param[in] nrf_error  Error code containing information about what went wrong.
 */
static void conn_params_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}


/**@brief Function for initializing the Connection Parameters module.
 */
static void conn_params_init(void)
{
    uint32_t               err_code;
    ble_conn_params_init_t cp_init;

    memset(&cp_init, 0, sizeof(cp_init));

    cp_init.p_conn_params                  = NULL;
    cp_init.first_conn_params_update_delay = FIRST_CONN_PARAMS_UPDATE_DELAY;
    cp_init.next_conn_params_update_delay  = NEXT_CONN_PARAMS_UPDATE_DELAY;
    cp_init.max_conn_params_update_count   = MAX_CONN_PARAMS_UPDATE_COUNT;
    cp_init.start_on_notify_cccd_handle    = BLE_GATT_HANDLE_INVALID;
    cp_init.disconnect_on_fail             = false;
    cp_init.evt_handler                    = on_conn_params_evt;
    cp_init.error_handler                  = conn_params_error_handler;

    err_code = ble_conn_params_init(&cp_init);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for putting the chip into sleep mode.
 *
 * @note This function will not return.
 */
static void sleep_mode_enter(void)
{
    uint32_t err_code = bsp_indication_set(BSP_INDICATE_IDLE);
    APP_ERROR_CHECK(err_code);

    // Prepare wakeup buttons.
    err_code = bsp_btn_ble_sleep_mode_prepare();
    APP_ERROR_CHECK(err_code);

    // Go to system-off mode (this function will not return; wakeup will cause a reset).
    err_code = sd_power_system_off();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling advertising events.
 *
 * @details This function will be called for advertising events which are passed to the application.
 *
 * @param[in] ble_adv_evt  Advertising event.
 */
static void on_adv_evt(ble_adv_evt_t ble_adv_evt)
{
    uint32_t err_code;

    switch (ble_adv_evt)
    {
        case BLE_ADV_EVT_FAST:
            err_code = bsp_indication_set(BSP_INDICATE_ADVERTISING);
            APP_ERROR_CHECK(err_code);
            break;
        //case BLE_ADV_EVT_IDLE:
            //sleep_mode_enter();
            //break;
        default:
            break;
    }
}


/**@brief Function for handling BLE events.
 *
 * @param[in]   p_ble_evt   Bluetooth stack event.
 * @param[in]   p_context   Unused.
 */
static void ble_evt_handler(ble_evt_t const * p_ble_evt, void * p_context)
{
    uint32_t err_code;
    ble_gap_evt_t const * p_gap_evt = &p_ble_evt->evt.gap_evt;
    printf("\rEntered handler\n");

    switch (p_ble_evt->header.evt_id)
    {
        case BLE_GAP_EVT_CONNECTED:
            NRF_LOG_INFO("Connected");
            err_code = bsp_indication_set(BSP_INDICATE_CONNECTED);
            APP_ERROR_CHECK(err_code);
            m_conn_handle = p_ble_evt->evt.gap_evt.conn_handle;
            //err_code = nrf_ble_qwr_conn_handle_assign(&m_qwr, m_conn_handle);
            //APP_ERROR_CHECK(err_code);
            for (uint32_t i = 0; i < NRF_SDH_BLE_PERIPHERAL_LINK_COUNT; i++)
            {
                if (m_qwr[i].conn_handle == BLE_CONN_HANDLE_INVALID)
                {
                    err_code = nrf_ble_qwr_conn_handle_assign(&m_qwr[i], m_conn_handle);
                    APP_ERROR_CHECK(err_code);
                    break;
                }
            }
            if (ble_conn_state_peripheral_conn_count() < NRF_SDH_BLE_PERIPHERAL_LINK_COUNT)
            {
                //bsp_board_led_off(ADVERTISING_LED);
                //printf("%d",ble_conn_state_peripheral_conn_count());
                advertising_start();
            }
            break;

        case BLE_GAP_EVT_DISCONNECTED:
            NRF_LOG_INFO("Disconnected");
            // LED indication will be changed when advertising starts.
            m_conn_handle = BLE_CONN_HANDLE_INVALID;
            break;

