ghsecuritylab/ble_timesync/nRF5_SDK_15.3.0_59ac345/Slave_Node/main.c
/**@brief  Function for initializing the UART module.
 */
/**@snippet [UART Initialization] */
static void uart_init(void)
{
    uint32_t                     err_code;
    app_uart_comm_params_t const comm_params =
    {
        .rx_pin_no    = RX_PIN_NUMBER,
        .tx_pin_no    = TX_PIN_NUMBER,
        .rts_pin_no   = RTS_PIN_NUMBER,
        .cts_pin_no   = CTS_PIN_NUMBER,
        .flow_control = APP_UART_FLOW_CONTROL_DISABLED,
        .use_parity   = false,
#if defined (UART_PRESENT)
        .baud_rate    = NRF_UART_BAUDRATE_115200
#else
        .baud_rate    = NRF_UARTE_BAUDRATE_115200
#endif
    };

    APP_UART_FIFO_INIT(&comm_params,
                       UART_RX_BUF_SIZE,
                       UART_TX_BUF_SIZE,
                       uart_event_handle,
                       APP_IRQ_PRIORITY_LOWEST,
                       err_code);
    APP_ERROR_CHECK(err_code);
}
/**@snippet [UART Initialization] */


/**@brief Function for initializing the Advertising functionality.
 */
static void advertising_init(void)
{
    uint32_t               err_code;
    ble_advertising_init_t init;

    memset(&init, 0, sizeof(init));

    init.advdata.name_type          = BLE_ADVDATA_FULL_NAME;
    init.advdata.include_appearance = false;
    init.advdata.flags              = BLE_GAP_ADV_FLAGS_LE_ONLY_LIMITED_DISC_MODE;

    init.srdata.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
    init.srdata.uuids_complete.p_uuids  = m_adv_uuids;

    init.config.ble_adv_fast_enabled  = true;
    init.config.ble_adv_fast_interval = APP_ADV_INTERVAL;
    init.config.ble_adv_fast_timeout  = APP_ADV_DURATION;
    init.evt_handler = on_adv_evt;

    err_code = ble_advertising_init(&m_advertising, &init);
    APP_ERROR_CHECK(err_code);

    ble_advertising_conn_cfg_tag_set(&m_advertising, APP_BLE_CONN_CFG_TAG);
}


/**@brief Function for initializing buttons and leds.
 *
 * @param[out] p_erase_bonds  Will be true if the clear bonding button was pressed to wake the application up.
 */
static void buttons_leds_init(bool * p_erase_bonds)
{
    bsp_event_t startup_event;

    uint32_t err_code = bsp_init(BSP_INIT_LEDS | BSP_INIT_BUTTONS, bsp_event_handler);
    APP_ERROR_CHECK(err_code);

    err_code = bsp_btn_ble_init(NULL, &startup_event);
    APP_ERROR_CHECK(err_code);

    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}


/**@brief Function for initializing the nrf log module.
 */
static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/**@brief Function for initializing power management.
 */
static void power_management_init(void)
{
    ret_code_t err_code;
    err_code = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the idle state (main loop).
 *
 * @details If there is no pending log operation, then sleep until next the next event occurs.
 */
static void idle_state_handle(void)
{
    if (NRF_LOG_PROCESS() == false)
    {
        nrf_pwr_mgmt_run();
    }
}



/**@brief Application main function.
 */
int main(void)
{
    bool erase_bonds;
    ret_code_t err_code;
    //all_xteristics val;
    //val.zero_incase = 1099511620000;
    //uint64_t stat = 1099511627774;
    //uint16_t buks = 11024;
    //sfloat_t stanc;
    //stan.f = 53.04f;
    //stanc.exponent = stan.parts.exponent;
    //stanc.mantissa = stan.parts.mantisa;
    //memset(&stanley[0], 0, sizeof(stanley));
    //uint16_t sta = bds_uint40_encode(&val.zero_incase, stanley);
    //uint16_t st = sizeof(stanley);


    // Initialize.
    uart_init();
    log_init();
    timers_init();
    buttons_leds_init(&erase_bonds);
    power_management_init();
    ble_stack_init();
    gap_params_init();
    gatt_init();
    services_init();
    advertising_init();
    conn_params_init();
    sync_timer_button_init();
    saadc_init();
    //ts_tx_start(200);

    // Start execution.
    //printf("\r\nUART started.\r\n");
    NRF_LOG_INFO("Debug logging for UART over RTT started.");
    advertising_start();
    //ble_siemens_service_update(&xteristics_status[MAX_INDEX], stanley, &sta, BLE_CONN_HANDLE_ALL, val, MAX_INDEX);

    // Enter main loop.
    for (;;)
    {
        if(data_ready == true)
        {
            if (ble_conn_state_peripheral_conn_count() > 1)
            {
                for(int i = 0; i < copy_sampling_size; i++)
                {
                    transmit_check = false;
                    csfloat_t code = encode_float(store_analogValues[i]);
                    memset(&adc_encode, 0, sizeof(adc_encode));
                    nrf_delay_ms(100);// depending on the phone, this delay can be removed
                    c_bds_sfloat_encode(&code, adc_encode);
                    err_code = ble_siemens_service_update(&xteristics_status[ADC_INDEX], adc_encode, &size_of_encode_float, BLE_CONN_HANDLE_ALL, store_analogValues[i]);
                    if(err_code == NRF_SUCCESS && transmit_check == true)
                    {
                        printf("\r%d\n",i);
                    }//else
                    //{
                       //i--;
                    //}
                }
            }

            compute_sample_mean();
            compute_rms();
            compute_zero_crossing();

            transmit_check = false;
            nrf_delay_ms(100);
            err_code = ble_siemens_service_update(&xteristics_status[MEAN_INDEX], sample_mean_encode, &size_of_encode_float, BLE_CONN_HANDLE_ALL, sample_mean);
            if(err_code == NRF_SUCCESS && transmit_check == true)
            {
                printf("\rThe error code for mean is %x\n", err_code);
            }else
            {
                printf("\rMean didnt work\n");
            }
            //printf("\rThe error code for mean is %x\n", err_code);

            transmit_check = false;
            //nrf_delay_ms(100);
            csfloat_t encode_min = encode_float(sample_min);
            c_bds_sfloat_encode(&encode_min, sample_min_encode);
            err_code = ble_siemens_service_update(&xteristics_status[MIN_INDEX], sample_min_encode, &size_of_encode_float, BLE_CONN_HANDLE_ALL, sample_min);
            if(err_code == NRF_SUCCESS && transmit_check == true)
            {
                printf("\rThe error code for min is %x\n", err_code);
            }else
            {
                printf("\rMin didnt work %x\n", err_code);
            }
            //printf("\rThe error code for min is %x\n", err_code);

            transmit_check = false;
            nrf_delay_ms(100);
            csfloat_t encode_max = encode_float(sample_max);
            c_bds_sfloat_encode(&encode_max, sample_max_encode);
            err_code = ble_siemens_service_update(&xteristics_status[MAX_INDEX], sample_max_encode, &size_of_encode_float, BLE_CONN_HANDLE_ALL, sample_max);
            if(err_code == NRF_SUCCESS && transmit_check == true)
            {
                printf("\rThe error code for max is %x\n", err_code);
            }else
            {
                printf("\rMax didnt work %x\n", err_code);
            }
            //printf("\rThe error code for max is %x\n", err_code);

            transmit_check = false;
            nrf_delay_ms(100);
            err_code = ble_siemens_service_update(&xteristics_status[RMS_INDEX], root_mean_square_encode, &size_of_encode_float, BLE_CONN_HANDLE_ALL, root_mean_square);
            if(err_code == NRF_SUCCESS && transmit_check == true)
            {
                printf("\rThe error code for root mean square is %x\n", err_code);
            }else
            {
                printf("\rRoot Mean Square didnt work %x\n", err_code);
            }
            //printf("\rThe error code for root mean square is %x\n", err_code);

            //send zero_crossing information
            for(int i = 0; i + 1 < sizeof(zero_crossing)/sizeof(zero_crossing[i]); i++)
            {
                transmit_check = false;
                nrf_delay_ms(100);// depending on the phone, this delay can be removed
                if (i % 2 == 0)
                {
                    csfloat_t code = encode_float(zero_crossing[i]);
                    memset(&z_adc_encode, 0, sizeof(z_adc_encode));
                    c_bds_sfloat_encode(&code, z_adc_encode);
                    err_code = ble_siemens_service_update(&xteristics_status[INCASE_INDEX], z_adc_encode, &size_of_encode_float, BLE_CONN_HANDLE_ALL, zero_crossing[i]);
                    //printf("\rThe error code for zero crossing is %x\n", err_code);
                    if(err_code == NRF_SUCCESS && transmit_check == true)
                    {
                        printf("\rPERFECT\n");
                    }
                } else
                {
                    zero_float_t code = zero_encode_float(zero_crossing[i]);
                    memset(&t_adc_encode, 0, sizeof(t_adc_encode));
                    uint16_t zero_size = zero_bds_sfloat_encode(&code, t_adc_encode);
                    err_code = ble_siemens_service_update(&xteristics_status[INCASE_INDEX], t_adc_encode, &zero_size, BLE_CONN_HANDLE_ALL, zero_crossing[i]);
                    //printf("\rThe error code for zero_crossing is %x\n", err_code);
                    if(err_code == NRF_SUCCESS && transmit_check == true)
                    {
                        printf("\rPERFECT\n");
                    }

                }
            }

            sample_mean = 0.0;
            sample_max = 0.0;
            sample_min = 0.0;
            root_mean_square = 0.0;

            measurment_begin = false;
            sampling_size = copy_sampling_size;
            data_ready = false;

            memset(&sample_mean_encode, 0, sizeof(sample_mean_encode));
            memset(&sample_min_encode, 0, sizeof(sample_min_encode));
            memset(&sample_max_encode, 0, sizeof(sample_max_encode));
            memset(&root_mean_square_encode, 0, sizeof(root_mean_square_encode));
        } 
        idle_state_handle();
    }
}


/**
 * @}
 */
